[
  {
    "id": "1",
    "title": "Black Panther",
    "storyline": "After the events of Captain America: Civil War, King T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new leader. However, T'Challa soon finds that he is challenged for the throne from factions within his own country. When two foes conspire to destroy Wakanda, the hero known as Black Panther must team up with C.I.A. agent Everett K. Ross and members of the Dora Milaje, Wakandan special forces, to prevent Wakanda from being dragged into a world war.                Written by\nEditor",
    "actors": [
      "Chadwick Boseman",
      "Michael B. Jordan",
      "Lupita Nyong'o"
    ],
    "genres": [
      "Action",
      "Adventure",
      "Sci-Fi"
    ],
    "year": "2018"
  },
  {
    "id": "2",
    "title": "Grottmannen Dug",
    "storyline": "Set at the dawn of time, when prehistoric creatures and woolly mammoths roamed the earth, Early Man tells the story of Dug, along with sidekick Hognob as they unite his tribe against a mighty enemy Lord Nooth and his Bronze Age City to save their home.",
    "actors": [
      "Tom Hiddleston",
      "Eddie Redmayne",
      "Maisie Williams"
    ],
    "genres": [
      "Animation",
      "Adventure",
      "Comedy"
    ],
    "year": "2018"
  },
  {
    "id": "3",
    "title": "Aiyaary",
    "storyline": "Two officers with patriotic hearts suddenly have a fallout. The mentor, Colonel Abhay Singh has complete faith in the country's system while protégé Major Jai Bakshi thinks differently due to a recent stint in surveillance.",
    "actors": [
      "Anupam Kher",
      "Sidharth Malhotra",
      "Naseeruddin Shah"
    ],
    "genres": [
      "Action",
      "Crime",
      "Drama"
    ],
    "year": "2018"
  },
  {
    "id": "4",
    "title": "Samson",
    "storyline": "A Hebrew with an unusual gift of strength must respond properly to the call of God on his life in order to lead his people out of enslavement. After his youthful ambition leads to a tragic marriage, his acts of revenge thrust him into direct conflict with the Philistine army. As his brother mounts a tribal rebellion, only Samson's relationship with a Philistine seductress and his final surrender - both to the Philistines and to God - turns imprisonment and blindness into final victory.                Written by\nPure Flix",
    "actors": [
      "Jackson Rathbone",
      "Billy Zane",
      "Taylor James"
    ],
    "genres": [
      "Action",
      "Drama"
    ],
    "year": "2018"
  },
  {
    "id": "5",
    "title": "Loveless",
    "storyline": "Still living under the same roof, the Moscow couple of Boris and Zhenya is in the terrible final stages of a bitter divorce. Under those circumstances, as both have already found new partners, the insults pour down like rain in this toxic familial battle zone, always pivoting around the irresolvable and urgent matter of Alyosha's custody, their 12-year-old only son. Unheard, unloved, and above all, unwanted, the introverted and unhappy boy feels that he is an intolerable burden, however, what his parents don't know is that he can hear every single word. As a result, when Boris and Zhenya finally realize that Alyosha has been missing for nearly two days, it is already too late. But is this a simple case of a runaway teenager?                Written by\nNick Riganas",
    "actors": [
      "Maryana Spivak",
      "Aleksey Rozin",
      "Matvey Novikov"
    ],
    "genres": [
      "Drama"
    ],
    "year": "2017"
  },
  {
    "id": "6",
    "title": "L'amant double",
    "storyline": "Disenchanted with the ephemeral glamour of the modelling world, Chloé, a vulnerable Parisian woman of 25, is convinced that the severe and persistent abdominal pains she's been suffering, stem mainly from a psychosomatic disorder. As a result, the reserved beauty will soon find herself on the couch of the charming therapist, Dr Paul Meyer, nevertheless, the mutual and unfailing sexual attraction between them will make it impossible to continue with the therapy. Before long, the ecstatic, yet unexplored lovers will move in together, however, Paul's obscure past will inevitably lead Chloé to the conclusion that there's definitely more to him than meets the eye. Is the doe-eyed woman lured into a world of hallucinations and dream-like sequences?                Written by\nNick Riganas",
    "actors": [
      "Marine Vacth",
      "Jérémie Renier",
      "Jacqueline Bisset"
    ],
    "genres": [
      "Drama",
      "Romance",
      "Thriller"
    ],
    "year": "2017"
  },
  {
    "id": "7",
    "title": "The Party",
    "storyline": "To celebrate her long-awaited prestigious post as a Shadow Minister for Health and, hopefully, the stepping stone to party leadership, the newly-appointed British opposition politician, Janet, is throwing a party for friends at her London flat. Of course, in this select and intimate soirée, apart from Bill--Janet's self-denying academic husband--a motley crew of elite hand-picked guests have been invited: There's April, the sourly cynical American best friend; her unlikely German husband, Gottfried; there's also Jinny and Martha; and finally, Tom, the smooth banker in the impeccable suit. But inevitably, before dinner is served, the upbeat ambience will shatter to pieces, as festering secrets will start surfacing in this perfect domestic war-zone. Undoubtedly, after this night, things will never be the same again.                Written by\nNick Riganas",
    "actors": [
      "Timothy Spall",
      "Kristin Scott Thomas",
      "Patricia Clarkson"
    ],
    "genres": [
      "Comedy",
      "Drama"
    ],
    "year": "2017"
  },
  {
    "id": "8",
    "title": "The Boy Downstairs",
    "storyline": "A young woman is forced to reflect on her first relationship when she inadvertently moves into her ex-boyfriend's apartment building.",
    "actors": [
      "Zosia Mamet",
      "Matthew Shear",
      "Deirdre O'Connell"
    ],
    "genres": [
      "Comedy",
      "Drama",
      "Romance"
    ],
    "year": "2017"
  },
  {
    "id": "9",
    "title": "Nostalgia",
    "storyline": "A mosaic of stories about love and loss, 'Nostalgia' explores our relationships to the objects, artifacts, and memories that shape our lives.",
    "actors": [
      "Hugo Armstrong",
      "Shinelle Azoroh",
      "Annalise Basso"
    ],
    "genres": [
      "Drama"
    ],
    "year": "2018"
  },
  {
    "id": "10",
    "title": "Oh Lucy!",
    "storyline": "The drama-comedy tells the story of Setsuko Kawashima (Terajima), a lonely, chain-smoking office lady in Tokyo who is past her prime. After deciding to take an English class, she discovers a new identity in her American alter ego, 'Lucy,' and falls for her instructor, John (Hartnett). When John suddenly disappears, Setsuko earnestly sets out on a quest to find him, eventually leading her to the outskirts of Southern California.                Written by\nOh Lucy!",
    "actors": [
      "Shinobu Terajima",
      "Josh Hartnett",
      "Kaho Minami"
    ],
    "genres": [
      "Comedy",
      "Drama"
    ],
    "year": "2017"
  },
  {
    "id": "11",
    "title": "Tehran Taboo",
    "storyline": "In their desperate search for freedom and happiness, four young people from Tehran, Iran are forced to break the taboos of a restrictive, islamic society.",
    "actors": [
      "Farhad Abadinejad",
      "Jasmina Ali",
      "Rozita Assadollahy"
    ],
    "genres": [
      "Animation",
      "Drama"
    ],
    "year": "2017"
  },
  {
    "id": "12",
    "title": "Xiyouji zhi Nü'erguo",
    "storyline": "",
    "actors": [
      "Aaron Kwok",
      "William Feng",
      "Zanilia Zhao"
    ],
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "year": "2018"
  },
  {
    "id": "13",
    "title": "Mind Game",
    "storyline": "The film follows Nishi, a loser who has a crush on his childhood girlfriend. After an encounter with the Japanese mafia, the film follows Nishi as he journeys to heaven and back, and ends up trapped in an even more unlikely place. Nishi (and some friends) attempt to break out of their trap, and discover what it truly means to be alive along the way. This is a mind-bending trip that uses some of the most innovative animation ever created.                Written by\nanimenewsnetwork.com",
    "actors": [
      "Kôji Imada",
      "Sayaka Maeda",
      "Takashi Fujii"
    ],
    "genres": [
      "Animation",
      "Adventure",
      "Comedy"
    ],
    "year": "2004"
  },
  {
    "id": "14",
    "title": "Western",
    "storyline": "A group of German construction workers start a tough job at a remote site in the Bulgarian countryside. The foreign land awakens the men's sense of adventure, but they are also confronted with their own prejudice and mistrust due to the language barrier and cultural differences. The stage is quickly set for a showdown when men begin to compete for recognition and favor from the local villagers.",
    "actors": [
      "Meinhard Neumann",
      "Reinhardt Wetrek",
      "Syuleyman Alilov Letifov"
    ],
    "genres": [
      "Drama"
    ],
    "year": "2017"
  },
  {
    "id": "15",
    "title": "Fifty Shades Freed",
    "storyline": "Believing they have left behind shadowy figures from their past, newlyweds Christian and Ana fully embrace an inextricable connection and shared life of luxury. But just as she steps into her role as Mrs. Grey and he relaxes into an unfamiliar stability, new threats could jeopardize their happy ending before it even begins.                Written by\nOfficial Synopsis",
    "actors": [
      "Dakota Johnson",
      "Jamie Dornan",
      "Eric Johnson"
    ],
    "genres": [
      "Drama",
      "Romance",
      "Thriller"
    ],
    "year": "2018"
  },
  {
    "id": "16",
    "title": "Pelle Kanin",
    "storyline": "Feature adaptation of Beatrix Potter's classic tale of a rebellious rabbit trying to sneak into a farmer's vegetable garden.",
    "actors": [
      "James Corden",
      "Fayssal Bazzi",
      "Domhnall Gleeson"
    ],
    "genres": [
      "Animation",
      "Adventure",
      "Comedy"
    ],
    "year": "2018"
  },
  {
    "id": "17",
    "title": "The 15:17 to Paris",
    "storyline": "In the early evening of August 21, 2015, the world watched in stunned silence as the media reported a thwarted terrorist attack on Thalys train #9364 bound for Paris--an attempt prevented by three courageous young Americans traveling through Europe. The film follows the course of the friends' lives, from the struggles of childhood through finding their footing in life, to the series of unlikely events leading up to the attack. Throughout the harrowing ordeal, their friendship never wavers, making it their greatest weapon and allowing them to save the lives of the more than 500 passengers on board.",
    "actors": [
      "Alek Skarlatos",
      "Anthony Sadler",
      "Spencer Stone"
    ],
    "genres": [
      "Drama",
      "History",
      "Thriller"
    ],
    "year": "2018"
  },
  {
    "id": "18",
    "title": "Jumanji: Welcome to the Jungle",
    "storyline": "In a brand new Jumanji adventure, four high school kids discover an old video game console and are drawn into the game's jungle setting, literally becoming the adult avatars they chose. What they discover is that you don't just play Jumanji - you must survive it. To beat the game and return to the real world, they'll have to go on the most dangerous adventure of their lives, discover what Alan Parrish left 20 years ago, and change the way they think about themselves - or they'll be stuck in the game forever, to be played by others without break.                Written by\nSony Pictures",
    "actors": [
      "Dwayne Johnson",
      "Karen Gillan",
      "Kevin Hart"
    ],
    "genres": [
      "Action",
      "Adventure",
      "Comedy"
    ],
    "year": "2017"
  },
  {
    "id": "19",
    "title": "The Greatest Showman",
    "storyline": "Orphaned, penniless but ambitious and with a mind crammed with imagination and fresh ideas, the American Phineas Taylor Barnum will always be remembered as the man with the gift to effortlessly blur the line between reality and fiction. Thirsty for innovation and hungry for success, the son of a tailor will manage to open a wax museum but will soon shift focus to the unique and peculiar, introducing extraordinary, never-seen-before live acts on the circus stage. Some will call Barnum's wide collection of oddities, a freak show; however, when the obsessed for cheers and respectability showman gambles everything on the opera singer Jenny Lind to appeal to a high-brow audience, he will somehow lose sight of the most important aspect of his life: his family. Will Barnum risk it all to be accepted?                Written by\nNick Riganas",
    "actors": [
      "Hugh Jackman",
      "Michelle Williams",
      "Zac Efron"
    ],
    "genres": [
      "Biography",
      "Drama",
      "Musical"
    ],
    "year": "2017"
  },
  {
    "id": "20",
    "title": "Maze Runner: The Death Cure",
    "storyline": "In the epic finale to The Maze Runner Saga, Thomas leads his group of escaped Gladers on their final and most dangerous mission yet. To save their friends, they must break into the legendary last city, a WCKD controlled labyrinth that may turn out to be the deadliest maze of all. Anyone who makes it out alive will get the answers to the questions the Gladers have been asking since they first arrived in the maze. Will Thomas and the crew make it out alive? Or will Ava Paige get her way?",
    "actors": [
      "Dylan O'Brien",
      "Ki Hong Lee",
      "Kaya Scodelario"
    ],
    "genres": [
      "Action",
      "Sci-Fi",
      "Thriller"
    ],
    "year": "2018"
  },
  {
    "id": "21",
    "title": "Winchester - House of Ghosts",
    "storyline": "Inspired by true events. On an isolated stretch of land 50 miles outside of San Francisco sits the most haunted house in the world. Built by Sarah Winchester, (Academy Award®-winner Helen Mirren) heiress to the Winchester fortune, it is a house that knows no end. Constructed in an incessant twenty-four hour a day, seven day a week mania for decades, it stands seven stories tall and contains hundreds of rooms. To the outsider it looks like a monstrous monument to a disturbed woman's madness. But Sarah is not building for herself, for her niece (Sarah Snook) or for the brilliant Doctor Eric Price (Jason Clarke) whom she has summoned to the house. She is building a prison, an asylum for hundreds of vengeful ghosts, and the most terrifying among them have a score to settle with the Winchesters.",
    "actors": [
      "Helen Mirren",
      "Sarah Snook",
      "Finn Scicluna-O'Prey"
    ],
    "genres": [
      "Biography",
      "Fantasy",
      "Horror"
    ],
    "year": "2018"
  },
  {
    "id": "22",
    "title": "The Post",
    "storyline": "When American military analyst, Daniel Ellsberg, realizes to his disgust the depths of the US government's deceptions about the futility of the Vietnam War, he takes action by copying top-secret documents that would become the Pentagon Papers. Later, Washington Post owner, Kay Graham, is still adjusting to taking over her late husband's business when editor Ben Bradlee discovers the New York Times has scooped them with an explosive expose on those papers. Determined to compete, Post reporters find Ellsberg himself and a complete copy of those papers. However, the Post's plans to publish their findings are put in jeopardy with a Federal restraining order that could get them all indicted for Contempt. Now, Kay Graham must decide whether to back down for the safety of her paper or publish and fight for the Freedom of the Press. In doing so, Graham and her staff join a fight that would have America's democratic ideals in the balance.                Written by\nKenneth Chisholm (kchishol@rogers.com)",
    "actors": [
      "Meryl Streep",
      "Tom Hanks",
      "Sarah Paulson"
    ],
    "genres": [
      "Biography",
      "Drama",
      "History"
    ],
    "year": "2017"
  },
  {
    "id": "23",
    "title": "Hostiles",
    "storyline": "In 1892, a legendary Army captain reluctantly agrees to escort a Cheyenne chief and his family through dangerous territory.",
    "actors": [
      "Scott Shepherd",
      "Rosamund Pike",
      "Ava Cooper"
    ],
    "genres": [
      "Adventure",
      "Drama",
      "Western"
    ],
    "year": "2017"
  },
  {
    "id": "24",
    "title": "The Shape of Water",
    "storyline": "From master storyteller Guillermo del Toro comes THE SHAPE OF WATER, an otherworldly fable set against the backdrop of Cold War era America circa 1962. In the hidden high-security government laboratory where she works, lonely Elisa (Sally Hawkins) is trapped in a life of isolation. Elisa's life is changed forever when she and co-worker Zelda (Octavia Spencer) discover a secret classified experiment. Rounding out the cast are Michael Shannon, Richard Jenkins, Michael Stuhlbarg, and Doug Jones.                Written by\nFox Searchlight Pictures",
    "actors": [
      "Sally Hawkins",
      "Octavia Spencer",
      "Michael Shannon"
    ],
    "genres": [
      "Adventure",
      "Drama",
      "Fantasy"
    ],
    "year": "2017"
  }
]
